Revit 2026 API

# ExternalResourceServerUtilsIsValidShortName Method

---

Checks whether the name is a valid short name for the external resource server.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidShortName(
	Guid serverId,
	string serverName
)
```
```vb
Public Shared Function IsValidShortName (
	serverId As Guid,
	serverName As String
) As Boolean
```
```cpp
public:
static bool IsValidShortName(
	Guid serverId,
	String^ serverName
)
```
```fsharp
static member IsValidShortName :
        serverId : Guid *
        serverName : string -> bool
```

#### Parameters

serverId Guid
     The id of the external resource server.
serverName String
     The short name of the external resource server.

#### Return Value

Boolean True if the name is a valid short name, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

A valid short name should match the restrictions documented in GetShortName.

#### Reference

ExternalResourceServerUtils Class

Autodesk.Revit.DB Namespace